"use strict";

/*
createElement('Тег') - создает єлемент
prepend(элемент) - Добавляет элемент в начало списка
append(элемент) - Добавляет элемент в конец списка ======== appendChild(элемент) - старая запись
before(Элемент) - Добавить єлемент перед єлементом
after(Элемент) - Добавить єлемент после єлементом
Родитель.insertBefore(элемент который нужно вставить, перед каким элементом нужно вставить) ========= Старая запись

remove() - Удалить єлемент =========== Родитель.removeChild('Какой элемент внутри родителя нужно удалить') - старая запись
replaceWith(Элемент на который нужно заменить) - Заменяет один элемент на другой удаляя заменяемый.
Родитель.replaceChild(Элемент на который нужно заменить, Элемент который нужно заменить) ========== старая запись

Родитель.insertAdjacentHTML("", '<h2>Hello</h2>')
afterbefin - Вставляет в начало элемента внутрь
afterend - Позволяет вставить после элемента
beforebegin - Позволяет вставить перед элементом
beforeend - Вставляет в конец элемента внутрь

*/